app/Filament/Widgets/Dashboard/CandidatesCount.php

    protected function getStats(): array
    {
        return [
            Stat::make(__('admin_dashboard.candidates'), Candidate::count())
                ->color(Color::Cyan)
                ->description(new HtmlString(__("admin_dashboard.to_create_candidate") . ', <a href="/admin/candidates/create"><u>' . __("admin_dashboard.click_here") . '</u></a>')),
            Stat::make(__("admin_dashboard.working_candidates"), Candidate::where('is_working', Candidate::STATUS_WORKING)->count())
                ->url('/admin/candidates-working'),
            Stat::make(__("admin_dashboard.active_orders"), Orders::where('is_active', Orders::STATUS_ACTIVE)->count())
                ->description(new HtmlString(__("admin_dashboard.to_create_order") . ', <a href="/admin/orders/create"><u>' . __("admin_dashboard.click_here") . '</u></a>'))
                ->color(Color::Teal),
            Stat::make(__("admin_dashboard.active_clients"), Customers::where('status', Customers::STATUS_ACTIVE)->count())
                ->description(new HtmlString(__("admin_dashboard.to_create_client") .', <a href="/admin/customers/create"><u>' . __("admin_dashboard.click_here") . '</u></a>'))
                ->color(Color::Cyan)
---
select count(*) as aggregate from `candidates` where `is_working` = '2'
select count(*) as aggregate from `orders` where `is_active` = '1'
select count(*) as aggregate from `customers` where `status` = '1'