app/Http/Controllers/HomeController.php

select * from `offers` where `is_top_offer` = 1 and `is_active` = 1
select * from `cities` where `cities`.`id` in (1, 2)
select * from `contracts` where `contracts`.`id` in (1, 2)
select * from `country` where `country`.`id` in (1, 2, 3)
select * from `sector` where `sector`.`id` in (2, 3)
---
    public function index()
    {

        $topOffers = Offers::where('is_top_offer', 1)->where('is_active', 1)->get();
        if(FileHelper::map_widget(true))FileHelper::map_widget(\request()->url());
        $topOffers->load([
            'country',
            'city',
            'sector',
            'currencies',
            'contract'
        ]);

select * from `offers` where `is_active` = 1
select * from `cities` order by `name` asc
select * from `sector`
---
        }
        else
        {
            $offers = Offers::where('is_active', 1)->get();
        }
        $countries = Countries::all();
        $cities = Cities::query()->orderBy('name')->get();
        $branches = Sectors::all();