app/Filament/Resources/OffersResource.php

    public static function table(Table $table): Table
    {
        return $table
            ->columns([
                Tables\Columns\TextColumn::make('title'),
                Tables\Columns\TextColumn::make('client_id')
                    ->label('Client')
                    ->formatStateUsing(fn($state) => Customers::find($state)->company_name),
                Tables\Columns\TextColumn::make('salary')
                    ->numeric()
                    ->prefix(fn($record)=>Currency::find($record->currency)?->sign),
                Tables\Columns\TextColumn::make('country_id')
                    ->label('Location')
                    ->formatStateUsing(function($record){
                        $country = Countries::find($record->country_id)?->name;
                        $city = Cities::find($record->city_id)?->name;

                        return $country . ', ' . $city;
                    }),
                Tables\Columns\TextColumn::make('cost_of_accommodation')
                    ->numeric()
                    ->alignCenter()
                    ->prefix(fn($record)=>Currency::find($record->currency)?->sign),
---
select * from `currency`
select * from `country`
select * from `customers`

    public static function getFormSchema(): array
    {
        return [
            TextInput::make('title')
                ->label(__('admin_offer.title')),
            TextInput::make('salary')
                ->label(__('admin_offer.salary')),
            TextInput::make('cost_of_accommodation')
                ->label(__('admin_offer.cost_of_accommodation')),
            TextInput::make('cost_of_insurance')
                ->label(__('admin_offer.cost_of_insurance')),
            TextInput::make('cost_of_transport')
                ->label(__('admin_offer.cost_of_transport')),
            Select::make('currency')
                ->label(__('admin_offer.currency'))
                ->options(function () {
                    return Currency::all()->mapWithKeys(function ($currency) {
                        return [$currency->id => $currency->sign . ' - ' . $currency->name];
                    });
                }),
---
select * from `currency` where `currency`.`id` = '2' limit 1